shellinea/2dof-stabilized-turret/firmware/esp32_turret/sdkconfig.defaults
# M2a 工程配置 —— 见 docs/03-BLE手柄接入执行文档.md §3.3
CONFIG_IDF_TARGET="esp32s3"

# 本板 YD-ESP32-S3-N16R8：16 MB Flash + 8 MB 八线 PSRAM
# 不设 16MB，BLE 的固件会放不下（默认 single app 分区只有 1 MB）
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# PSRAM 必须选 OCT（八线），QUAD 用不了
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y

# 蓝牙：用 NimBLE 协议栈，不是 Bluedroid
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
